package com.collection.class23.HW;

public class Task1 {

    /*
    1. Написать программу: userClass, которая имеет конструктор, инициализирующий переменную экземпляра имя и номер мобильного телефона.
    Создать подкласс userInfo, который будет содержать переменную адреса пользователя и также инициализироваться через вызов конструктора.
    Вывести имя, номер мобильного телефона и адрес пользователя в методе userDetails.
    Протестируйте свой код.

    2. Написать программу: Класс Shape имеет конструктор, который принимает радиус, и имеет подкласс в виде класса circle.
    В классе circle создайте метод для вычисления площади круга. Протестируйте свой код
     */
}
