package com.collection.class2021.HW;

public class HW {

    /*
    1. Напишите программу для многоуровневого наследования,
    в которой класс A наследуется классом B, а класс B наследуется классом C.

    2. Напишите программу для наследования класса A, имеющего статический метод printF,
    и вызова для повторного использования этого метода в классе B.

3. Напишите программу на языке Java под названием Teacher.
   Определите особенности и поведение этого класса.
   Создайте 3 подкласса MathTeacher, ChemistryTeacher и PianoTeacher,
   которые будут иметь свои особенности и поведение. Протестируйте все 4 класса

     */
}
