package com.company.class2120.task2;

public class ClassA {
    /*
   2. Write program to inherit class A that has
    method printF which is static and call or
    reuse that method into class B.
    2. Напишите программу для наследования класса A, который имеет
    метод printF, который является статическим, и вызвать или
    повторно использовать этот метод в классе B.
     */
    public static void printF(){
        System.out.println("Just a printF method");
    }
}
