package com.company.class17;

public class Task2 {
    /*
    Create a class called Students
    Create three variables, studentID and numberOfStudents
    Create three objects of the Students Class
    Set the value for studentName, studentID and increment the numberOfStudents for each object
    Print out total number of students

    Создайте класс под названием Students
    Создайте три переменные, studentID и numberOfStudents
    Создайте три объекта класса Students
    Установите значение для studentName, studentID и увеличьте numberOfStudents для каждого объекта
    Выведите общее количество студентов
     */
    public static void main(String[] args) {
        AccessModifiedDemo1 accessModifiedDemo1 = new AccessModifiedDemo1();

        System.out.println(accessModifiedDemo1.age);
        accessModifiedDemo1.method2();
    }
}
