package com.syntax.class11;

public class Group {

	public static void main(String[] args) {
		
		
		/*
		 * 1. Создать двумерный массив или тип integer и хранить числа в 3 строках и 3 столбцах. Выведите сумму всех чисел.
* 2. Создайте двумерный массив или целочисленный тип, в котором будут храниться четные и нечетные числа в 3 строках и 4 столбцах. Разработать программу, которая будет определять/печатать только четные числа.
* 3. Создать двумерный массив или целочисленный тип, в котором будут храниться целые значения в 3 строках и 4 столбцах. Разработайте программу, которая будет вычислять сумму четных и нечетных чисел для этого массива.
* 4. Напишите программу, которая будет менять местами 2 числа без временной переменной?
* 5. Напишите java-программу для проверки того, является ли данное число простым или нет?
* 6. Напишите Java-программу для печати первых 10 чисел ряда Фибоначчи.
* Серия Фибоначчи.
* 7. Максимальное и минимальное число в массиве?
* 8. Напишите java-программу для нахождения второго по величине числа в массиве?
* Кодовые решения должны быть загружены на ваш собственный аккаунт GitHub
		 */
	}

}
