package com.syntax.class14;

public class HW {

	
/*
 * 1. Создать метод, который принимает 2 параметра в виде чисел и выводит, какое число больше.
 * 2. Создайте метод, который принимает число и выводит четное или нечетное число.
 * 3. Создать метод, который будет выводить, является ли данная строка палиндромом или нет - 
 *    (если строка перевернутая такая же, то это полидром).
 * 4. Создать метод, который будет говорить Hello на разных языках в зависимости от страны, 
 *    которая будет передана при выполнении метода.
 */
	
	
}
