package com.collection.class25.HW;

public class HW1 {

    /*
    1. Создайте класс 'Degree', имеющий метод
       'getPrerequisite', который выводит: "Для получения степени необходим аттестат о среднем образовании".
       Класс 'Degree' имеет 2 подкласса, а именно
       'Bachelors' и 'Masters'. В классе Masters переопределить метод 'getPrerequisite'.
     - Вызовите метод, создав объект каждого из трех классов.

   2. Создайте класс CreditCard и определите переменные balance и interest.
      Создать метод экземпляра, который будет рассчитывать проценты на основе заданного баланса.
    - Создать 2 подкласса: Visa и AX. В классе AX переопределить метод calculate interest.
    - Вызовите метод, создав объект каждого из трех классов.

   3. Создайте класс Student, который будет иметь три подкласса: SyntaxStudent, CollegeStudent, SchoolStudent.
     - Определите общее поведение в родительском классе и переопределите некоторые методы в дочерних классах
     - Определите некоторые методы, специфичные для дочерних классов.
     - Напишите пример достижения полиморфизма во время выполнения
     */
}
