package com.collection.class17;

public class Task2 {

    /*
    Создайте класс с именем Students
    Создать три переменные studentName, studentID и numberOfStudents
    Создать три объекта класса Students
    Установите значение для переменных studentName, studentID и увеличьте значение numberOfStudents для каждого объекта
    Вывести общее количество студентов
     */

    public static void main(String[] args) {

        AccessModifierDemo1 accessModifierDemo1 = new AccessModifierDemo1();

        System.out.println(accessModifierDemo1.age);
    }
}
