package com.syntax.class10;

public class TwoDArrays {

    /**
     * 2D (двухмерный) массив
     */
    public static void main(String[] args) {

        int a;
        int[] b = new int[3];

        // Создание двумерного массива
        int[][] c = new int[3][4];   // [3] - строки, [4] - столбцы

        // 1-я строка или 1-й массив
        c[0][0] = 11;
        c[0][1] = 12;
        c[0][2] = 13;
        c[0][3] = 14;

        // 2-я строка или 2-й массив
        c[1][0] = 20;
        c[1][1] = 30;
        c[1][2] = 40;
        c[1][3] = 50;

        // 3-я строка или 3-й массив
        c[2][0] = 100;
        c[2][1] = 200;
        c[2][2] = 300;
        c[2][3] = 400;

        System.out.println(c[1][3]); // - для доступа указать, с какого индекса строки и индекса столбца
        System.out.println(c[2][1]);

        System.out.println("---------- Другой способ создания 2D (двумерного) массива ----------");

        int[][] myArray = {
                {11, 12, 13, 14, 15},  // 1-й массив
                {20, 30, 40}, // 2-й массив
                {100, 200, 300, 400} // 3-й массив
        };

        System.out.println(myArray[0][4]); //15
        System.out.println(myArray[1][0]); //20

    }
}


